return the index of this connector
  Namespace:   Autodesk.Revit.DB.Mechanical
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public int Index { get; }
  Visual Basic
Public ReadOnly Property Index As Integer
	Get
  Visual C++
public:
property int Index {
	int get ();
}
 See Also
  DuctFittingAndAccessoryConnectorData Class
  Autodesk.Revit.DB.Mechanical Namespace